app/views/courses/_overview.html.erb

<% for prereq in @course.prerequisites %>
<%= link_to prereq.course_numberings.first.toString,
    course_path(prereq.id) %>
---
SELECT "course_numberings".* FROM "course_numberings" WHERE "course_numberings"."course_id" = 1 LIMIT 1
SELECT "courses".* FROM "courses" INNER JOIN "prerequisite_relations" ON "courses"."id" = "prerequisite_relations"."prerequisite_id" WHERE "prerequisite_relations"."course_id" = 1