app/controllers/courses_controller.rb

  def show
    @course = Course.find_by_id(params[:id])
    @reviews = Review.where("course_id = ?", params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE (course_id = '1')

  def index
    @search = Course.search do
      fulltext params[:search]
    end
    @courses = @search.results


    @subjects = Subject.all
---
SELECT "courses".* FROM "courses"
SELECT "subjects".* FROM "subjects"

  def results
    @search = Course.search do
      fulltext params[:search]
    end
    @courses = @search.results


    @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"