app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1
SELECT "courses".* FROM "courses" INNER JOIN "prerequisite_relations" ON "courses"."id" = "prerequisite_relations"."prerequisite_id" WHERE "prerequisite_relations"."course_id" = 1
---
  def show
    @course = Course.find_by_id(params[:id])
    @course_meta = CourseMeta.find(@course.course_meta_id)

SELECT "courses".* FROM "courses" INNER JOIN "prerequisite_relations" ON "courses"."id" = "prerequisite_relations"."prerequisite_id" WHERE "prerequisite_relations"."course_id" = 1
SELECT "subjects".* FROM "subjects" INNER JOIN "course_numberings" ON "subjects"."id" = "course_numberings"."subject_id" WHERE "course_numberings"."course_id" = 1
---
  def index
    currentUser = current_or_guest_user
    if(params[:currentSession]!=nil)
      currentUser.session=Session.find_by_name(params[:currentSession])
      currentUser.save
    end


    @subjects = Subject.includes(:courses).where("courses.session_id IN(?)", currentUser.session.id).sort_by &:abbr