app/controllers/reviews_controller.rb

  def create
    @review = Review.new(params[:review])
    if @review.save
---
INSERT INTO "reviews" ("assignment_easiness", "clarity", "course_content", "course_id", "created_at", "enthusiasm", "helpfulness", "instructor_id", "review_content", "test_easiness", "textbook_usefulness", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)