app/controllers/static_pages_controller.rb

SELECT "courses".* FROM "courses"
---
  def home
    @courses = Course.all