app/controllers/subjects_controller.rb

  def show
    p params
    @subject = Subject.find(params[:id])
    @courses = @subject.courses.paginate(:page => params[:page], :per_page => 15)
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "courses".* FROM "courses" INNER JOIN "prerequisite_relations" ON "courses"."id" = "prerequisite_relations"."prerequisite_id" WHERE "prerequisite_relations"."course_id" = 1